# MultiPlanarDepth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarShapeFailures..::..MultiPlanarDepth Property
BuiltInFailures..::..RebarShapeFailures Class See Also
---
Multi-planar depth of Rebar Shape can't be too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MultiPlanarDepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultiPlanarDepth As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MultiPlanarDepth {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarShapeFailures Class
Autodesk.Revit.DB Namespace